# specify a directory to install
cask_args appdir: '/Applications'
# install packages
brew 'git'

tap 'neovim/neovim' || true
brew 'neovim'

brew 'ranger'
brew 'nvm'
brew 'cloudflared'
brew 'fish'
brew 'fisher'
brew 'tmux'
brew 'fastfetch'
brew 'gh'
brew 'lsd'
brew 'tree'
brew 'tree-sitter'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'btop'

cask 'raycast'
cask 'spotify'
cask 'font-fontawesome'
cask 'kitty'
cask 'sf-symbols'
cask 'font-sf-pro'
cask 'visual-studio-code'
cask 'docker'
cask 'discord'
cask 'prefs-editor'
cask 'mos'